In [1]:
from sql_database import SQLDatabase
import pandas as pd

In [17]:
#Server name changed
connection_string = r'Driver={ODBC Driver 17 for SQL Server}; Server=LAPTOP-U92BNK27; Database=PYMSSQLHandler; Trusted_Connection=yes;'

In [3]:
sql_database = SQLDatabase(connection_string)

In [4]:
sql_database.execute("""
CREATE TABLE Employees
(
ID INT IDENTITY PRIMARY KEY
,LastName NVARCHAR(50)
,FirstName NVARCHAR(50)
,JobTitle NVARCHAR(25)
,Salary DECIMAL(19, 4)
);
""")

In [5]:
employees = pd.DataFrame({
    'LastName': ['Newman', 'Michaelson', 'Smith'],
    'FirstName': ['Bob', 'John', 'Donny'],
    'JobTitle': ['Data Scientist', 'Accountant', 'Librarian'],
    'Salary': [110000.00, 95000.00, 67000.00]
})
employees

     LastName FirstName        JobTitle    Salary
0      Newman       Bob  Data Scientist  110000.0
1  Michaelson      John      Accountant   95000.0
2       Smith     Donny       Librarian   67000.0

In [6]:
sql_database.bulk_insert(employees, 'Employees')
sql_database.query('SELECT * FROM Employees')

   ID    LastName FirstName        JobTitle    Salary
0   1      Newman       Bob  Data Scientist  110000.0
1   2  Michaelson      John      Accountant   95000.0
2   3       Smith     Donny       Librarian   67000.0

In [7]:
sql_database.execute("""
CREATE OR ALTER PROCEDURE uspAddNewEmployee
    @LastName NVARCHAR(50),
    @FirstName NVARCHAR(50)
AS
BEGIN
    INSERT INTO Employees
    (LastName, FirstName)
    Values
    (@LastName, @FirstName)
END;
"""
)

In [8]:
sql_database.execute('EXEC uspAddNewEmployee @LastName=?, @FirstName=?', 'Summers', 'Donna')
sql_database.query('SELECT * FROM Employees')

   ID    LastName FirstName        JobTitle    Salary
0   1      Newman       Bob  Data Scientist  110000.0
1   2  Michaelson      John      Accountant   95000.0
2   3       Smith     Donny       Librarian   67000.0
3   4     Summers     Donna            None       NaN